/*
*********************************************************************************************************
*                                                   ePDK
*                                   the Easy Portable/Player Develop Kits
*                                              calendar app sample
*
*                                   (c) Copyright 2006-2009, ANDY, China
*                                            All Rights Reserved
*
* File    : sset_input.h
* By      :lyn
* Version : V1.00
*********************************************************************************************************
*/
#ifndef __SSET_INPUT_H__
#define __SSET_INPUT_H__

/*
*************************************************************************************
*                                       SSET_ItemAttr_Create
*
*Description: SSET内部参数数据创建
*
*Arguments  : para  ：用户输入数据头指针
*
*Return     : 内部数据结构头指针
*
*************************************************************************************
*/
__sset_item_t *SSET_ItemAttr_Create(__sset_item_para_t  *para);

/*
*************************************************************************************
*                                       SSET_ItemAttr_Destroy
*
*Description: SSET内部参数数据销毁
*
*Arguments  : phead  : 内部数据指针
*
*Return     : NULL
*
*************************************************************************************
*/
__s32 SSET_ItemAttr_Destroy(__sset_item_t *phead);

/*
************************************************************************************************************************
*                                       SSET_ItemAttr_Insert
*
*Description: 插入一组条目
*
*Arguments  : pitem 要插入条目的插入节点
*             para  插入条目的头指针
*             num   插入的条目数
*
*Return     :
*
************************************************************************************************************************
*/
__s32 SSET_ItemAttr_Insert(__sset_item_t *pitem, __sset_item_para_t *para, __u32 num, __sset_item_insert_mode_e mode);

/*
************************************************************************************************************************
*                                       SSET_ItemAttr_Delete
*
*Description: 删除一组条目
*
*Arguments  : pitem 删除条目所挂载的节点
*
*Return     :
*
************************************************************************************************************************
*/
__s32 SSET_ItemAttr_Delete(__sset_item_t *pitem, __sset_item_delete_mode_e mode);

/*
************************************************************************************************************************
*                                       SSET_ItemAttr_Search
*
*Description: 释放用户数据所占内存
*
*Arguments  :
*
*Return     :
*
************************************************************************************************************************
*/
__sset_item_t *SSET_ItemAttr_Search(char *name, __sset_item_t *pitem);

/*
************************************************************************************************************************
*                                       SSET_ItemAttr_Ennable
*
*Description: 释放用户数据所占内存
*
*Arguments  :
*
*Return     :
*
************************************************************************************************************************
*/
__s32 SSET_ItemAttr_Ennable(__sset_item_t *pitem);

/*
************************************************************************************************************************
*                                       SSET_ItemAttr_Disable
*
*Description: 释放用户数据所占内存
*
*Arguments  :
*
*Return     :
*
************************************************************************************************************************
*/
__s32 SSET_ItemAttr_Disable(__sset_item_t *pitem);

/*
************************************************************************************************************************
*                                       SSET_Item_SetAttr
*
*Description: 释放用户数据所占内存
*
*Arguments  :
*
*Return     :
*
************************************************************************************************************************
*/
__s32 SSET_Item_SetAttr(__sset_item_t *pitem, __sset_item_attr_t *attr);

/*
************************************************************************************************************************
*                                       SSET_Item_GetAttr
*
*Description: 释放用户数据所占内存
*
*Arguments  :
*
*Return     :
*
************************************************************************************************************************
*/
__s32 SSET_Item_GetAttr(__sset_item_t *pitem, __sset_item_attr_t *attr);


#endif  /* __SSET_INPUT_H__ */
